# Олимпиадная задача про зайца
# В нашем зоопарке появился заяц. Его поместили в клетку, и чтобы ему не было скучно, директор зоопарка распорядился поставить 
# в его клетке лесенку. Теперь наш зайчик может прыгать по лесенке вверх, перепрыгивая через ступеньки. 
# Лестница имеет определенное количество ступенек N. Заяц может одним прыжком преодолеть не более К ступенек. 
# Для разнообразия зайчик пытается каждый раз найти новый путь к вершине лестницы. Директору любопытно, сколько различных 
# способов есть у зайца добраться до вершины лестницы при заданных значениях K и N. Помогите директору написать программу, 
# которая поможет вычислить это количество. Например, если K=3 и N=4, то существуют следующие маршруты: 
# 1+1+1+1, 1+1+2, 1+2+1, 2+1+1, 2+2, 1+3, 3+1. 
# Т.е. при данных значениях у зайца всего 7 различных маршрутов добраться до вершины лестницы.

from itertools import product

# number steps
n = 4
# number jumping steps
k = 3

def get_variants(n, k):
    variants = [i for i in range(0,k+1)]
    args = [variants for _ in range(n)]
    generation_variants = product(*args)
    result = []
    ind = 0
    for variant in generation_variants:
        if sum(variant) == n:
            variant = (i for i in variant if i > 0)
            result.append(tuple(variant))
            ind += 1
    result = list(set(result))
    return result

get_variants(n, k) # Out[1]: [(1, 2, 1), (1, 3), (3, 1), (2, 1, 1), (1, 1, 1, 1), (1, 1, 2), (2, 2)]
